Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg55/atdf/ATSAMG55G19.atdf
          </instance>
        </module>
        <module name="CMCC" id="11108" version="F">
          <instance name="CMCC">
            <register-group address-space="base" name="CMCC" name-in-module="CMCC" offset="0x4003C000"/>
          </instance>
        </module>
        <module name="CRCCU" id="11001" version="I">
          <instance name="CRCCU">
            <register-group address-space="base" name="CRCCU" name-in-module="CRCCU" offset="0x40048000"/>
            <parameters>
              <param name="INSTANCE_ID" value="49"/>
              <param name="CLOCK_ID" value="49"/>
              <param name="DMA_DESC_LEN" value="20"/>
            </parameters>
          </instance>
        </module>
        <module name="EFC" id="6450" version="U">
          <instance name="EFC">
            <register-group address-space="base" name="EFC" name-in-module="EFC" offset="0x400E0A00"/>
            <signals>
              <signal pad="PB12" function="X1" group="ERASE"/>
            </signals>
            <parameters>
              <param name="FLASH_SIZE" value="524288"/>
              <param name="PAGE_SIZE" value="512"/>
              <param name="PAGES_PR_REGION" value="16"/>
              <param name="INSTANCE_ID" value="6"/>
            </parameters>
          </instance>
        </module>
        <module name="FLEXCOM" id="11277" version="A">
          <instance name="FLEXCOM0">
            <register-group address-space="base" name="FLEXCOM0" name-in-module="FLEXCOM" offset="0x4000C000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="24"/>
              <param name="DMAC_ID_RX" value="10"/>
              <param name="INSTANCE_ID" value="8"/>
              <param name="CLOCK_ID" value="8"/>
            </parameters>
          </instance>
          <instance name="FLEXCOM1">
            <register-group address-space="base" name="FLEXCOM1" name-in-module="FLEXCOM" offset="0x40020000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="23"/>
              <param name="DMAC_ID_RX" value="9"/>
              <param name="INSTANCE_ID" value="9"/>
              <param name="CLOCK_ID" value="9"/>
            </parameters>
          </instance>
          <instance name="FLEXCOM2">
            <register-group address-space="base" name="FLEXCOM2" name-in-module="FLEXCOM" offset="0x40024000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="22"/>
              <param name="DMAC_ID_RX" value="8"/>
              <param name="INSTANCE_ID" value="14"/>
              <param name="CLOCK_ID" value="14"/>
            </parameters>
          </instance>
          <instance name="FLEXCOM3">
            <register-group address-space="base" name="FLEXCOM3" name-in-module="FLEXCOM" offset="0x40018000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="17"/>
              <param name="DMAC_ID_RX" value="0"/>
              <param name="INSTANCE_ID" value="19"/>
              <param name="CLOCK_ID" value="19"/>
            </parameters>
          </instance>
          <instance name="FLEXCOM4">
            <register-group address-space="base" name="FLEXCOM4" name-in-module="FLEXCOM" offset="0x4001C000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="26"/>
              <param name="DMAC_ID_RX" value="12"/>
              <param name="INSTANCE_ID" value="20"/>
              <param name="CLOCK_ID" value="20"/>
            </parameters>
          </instance>
          <instance name="FLEXCOM5">
            <register-group address-space="base" name="FLEXCOM5" name-in-module="FLEXCOM" offset="0x40008000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="27"/>
              <param name="DMAC_ID_RX" value="13"/>
              <param name="INSTANCE_ID" value="21"/>
              <param name="CLOCK_ID" value="21"/>
            </parameters>
          </instance>
          <instance name="FLEXCOM6">
            <register-group address-space="base" name="FLEXCOM6" name-in-module="FLEXCOM" offset="0x40040000"/>
            <parameters>
              <param name="DMAC_ID_TX" value="25"/>
              <param name="DMAC_ID_RX" value="11"/>
              <param name="INSTANCE_ID" value="22"/>
              <param name="CLOCK_ID" value="22"/>
            </parameters>
          </instance>
        </module>
        <module name="GPBR" id="6378" version="G">
          <instance name="GPBR">
            <register-group address-space="base" name="GPBR" name-in-module="GPBR" offset="0x400E1490"/>
          </instance>
        </module>
        <module name="ICE">
          <instance name="ICE">
            <signals>
              <signal pad="PB4" function="X1" group="TDI"/>
              <signal pad="PB5" function="X1" group="TDO"/>
              <signal pad="PB5" function="X1" group="TRACESWO"/>
              <signal pad="PB6" function="X1" group="TMS"/>
              <signal pad="PB6" function="X1" group="SWDIO"/>
              <signal pad="PB7" function="X1" group="TCK"/>
              <signal pad="PB7" function="X1" group="SWDCLK"/>
            </signals>
          </instance>
        </module>
        <module name="I2SC" id="11241" version="F">
          <instance name="I2SC0">
            <register-group address-space="base" name="I2SC0" name-in-module="I2SC" offset="0x40000000"/>
            <signals>
              <signal pad="PA0" function="A" group="I2SCK" index="0"/>
              <signal pad="PA2" function="B" group="I2SDI" index="0"/>
              <signal pad="PA3" function="B" group="I2SDO" index="0"/>
              <signal pad="PA17" function="A" group="I2SDO" index="0"/>
              <signal pad="PA4" function="B" group="I2SMCK" index="0"/>
              <signal pad="PA18" function="A" group="I2SMCK" index="0"/>
              <signal pad="PA1" function="A" group="I2SWS" index="0"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX0" value="2"/>
              <param name="DMAC_ID_TX1" value="3"/>
              <param name="DMAC_ID_RX0" value="18"/>
              <param name="DMAC_ID_RX1" value="19"/>
              <param name="INSTANCE_ID" value="16"/>
              <param name="CLOCK_ID" value="16"/>
            </parameters>
          </instance>
          <instance name="I2SC1">
            <register-group address-space="base" name="I2SC1" name-in-module="I2SC" offset="0x40004000"/>
            <signals>
              <signal pad="PA19" function="B" group="I2SCK" index="1"/>
              <signal pad="PA22" function="B" group="I2SDI" index="1"/>
              <signal pad="PA23" function="A" group="I2SDO" index="1"/>
              <signal pad="PA25" function="B" group="I2SDO" index="1"/>
              <signal pad="PA24" function="A" group="I2SMCK" index="1"/>
              <signal pad="PA26" function="B" group="I2SMCK" index="1"/>
              <signal pad="PA20" function="B" group="I2SWS" index="1"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_TX0" value="4"/>
              <param name="DMAC_ID_TX1" value="5"/>
              <param name="DMAC_ID_RX0" value="20"/>
              <param name="DMAC_ID_RX1" value="21"/>
              <param name="INSTANCE_ID" value="17"/>
              <param name="CLOCK_ID" value="17"/>
            </parameters>
          </instance>
        </module>
        <module name="MATRIX" id="11049" version="F">
          <instance name="MATRIX">
            <register-group address-space="base" name="MATRIX" name-in-module="MATRIX" offset="0x400E0200"/>
