Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg55/atdf/ATSAMG55G19.atdf
        <module name="WDT" id="6080" version="H">
          <instance name="WDT">
            <register-group address-space="base" name="WDT" name-in-module="WDT" offset="0x400E1450"/>
            <parameters>
              <param name="INSTANCE_ID" value="4"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="1" version="1">
          <instance name="FUSES">
            <register-group address-space="fuses" name="GPNVMBITS" name-in-module="GPNVMBITS" offset="0"/>
          </instance>
        </module>
        <module name="LOCKBIT" id="1" version="1">
          <instance name="LOCKBIT">
            <register-group address-space="lockbits" name="LOCKBIT" name-in-module="LOCKBIT" offset="0"/>
          </instance>
        </module>
        <module name="SystemControl">
          <instance name="SystemControl">
            <register-group address-space="base" offset="0xE000E000" name-in-module="SystemControl" name="SystemControl"/>
          </instance>
        </module>
        <module name="SysTick">
          <instance name="SysTick">
            <register-group address-space="base" offset="0xE000E010" name-in-module="SysTick" name="SysTick"/>
          </instance>
        </module>
        <module name="NVIC">
          <instance name="NVIC">
            <register-group address-space="base" offset="0xE000E100" name-in-module="NVIC" name="NVIC"/>
          </instance>
        </module>
        <module name="MPU">
          <instance name="MPU">
            <register-group address-space="base" offset="0xE000ED90" name-in-module="MPU" name="MPU"/>
          </instance>
        </module>
      </peripherals>
      <interrupts xmlns:header="http://www.atmel.com/schemas/avr-tools-device-file/header">
        <interrupt index="-15" name="Reset" caption="Reset Vector, invoked on Power up and warm reset" header:alternate-caption="Reset Vector"/>
        <interrupt index="-14" name="NonMaskableInt" caption="Non maskable Interrupt, cannot be stopped or preempted" header:alternate-caption="Non-maskable Interrupt"/>
        <interrupt index="-13" name="HardFault" caption="Hard Fault, all classes of Fault" header:alternate-caption="Hard Fault"/>
        <interrupt index="-12" name="MemoryManagement" caption="Memory Management, MPU mismatch, including Access Violation and No Match" header:alternate-caption="Memory Management Fault"/>
        <interrupt index="-11" name="BusFault" caption="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault" header:alternate-caption="Bus Fault"/>
        <interrupt index="-10" name="UsageFault" caption="Usage Fault, i.e. Undef Instruction, Illegal State Transition" header:alternate-caption="Usage Fault"/>
        <interrupt index="-5" name="SVCall" caption="System Service Call via SVC instruction" header:alternate-caption="SuperVisor Call"/>
        <interrupt index="-4" name="DebugMonitor" caption="Debug Monitor" header:alternate-caption="Debug Monitor"/>
        <interrupt index="-2" name="PendSV" caption="Pendable request for system service" header:alternate-caption="Pendable SerVice"/>
        <interrupt index="-1" name="SysTick" caption="System Tick Timer"/>
        <interrupt index="0" module-instance="SUPC" name="SUPC" caption="Supply Controller"/>
        <interrupt index="1" module-instance="RSTC" name="RSTC" caption="Reset Controller"/>
        <interrupt index="2" module-instance="RTC" name="RTC" caption="Real Time Clock"/>
        <interrupt index="3" module-instance="RTT" name="RTT" caption="Real Time Timer"/>
        <interrupt index="4" module-instance="WDT" name="WDT" caption="Watchdog Timer"/>
        <interrupt index="5" module-instance="PMC" name="PMC" caption="Power Management Controller"/>
        <interrupt index="6" module-instance="EFC" name="EFC" caption="Enhanced Flash Controller"/>
        <interrupt index="8" module-instance="FLEXCOM0" name="FLEXCOM0" caption="FLEXCOM 0"/>
        <interrupt index="9" module-instance="FLEXCOM1" name="FLEXCOM1" caption="FLEXCOM 1"/>
        <interrupt index="11" module-instance="PIOA" name="PIOA" caption="Parallel I/O Controller A"/>
        <interrupt index="12" module-instance="PIOB" name="PIOB" caption="Parallel I/O Controller B"/>
        <interrupt index="13" module-instance="PDMIC0" name="PDMIC0" caption="PDM 0"/>
        <interrupt index="14" module-instance="FLEXCOM2" name="FLEXCOM2" caption="FLEXCOM 2"/>
        <interrupt index="15" module-instance="MEM2MEM" name="MEM2MEM" caption="MEM2MEM"/>
        <interrupt index="16" module-instance="I2SC0" name="I2SC0" caption="I2SC0"/>
        <interrupt index="17" module-instance="I2SC1" name="I2SC1" caption="I2SC1"/>
        <interrupt index="18" module-instance="PDMIC1" name="PDMIC1" caption="PDM 1"/>
        <interrupt index="19" module-instance="FLEXCOM3" name="FLEXCOM3" caption="FLEXCOM 3"/>
        <interrupt index="20" module-instance="FLEXCOM4" name="FLEXCOM4" caption="FLEXCOM 4"/>
        <interrupt index="21" module-instance="FLEXCOM5" name="FLEXCOM5" caption="FLEXCOM 5"/>
        <interrupt index="22" module-instance="FLEXCOM6" name="FLEXCOM6" caption="FLEXCOM 6"/>
        <interrupt index="23" module-instance="TC0" name="TC0" header:alternate-name="TC0_CH0" caption="Timer/Counter 0" header:alternate-caption="Timer/Counter 0 Channel 0"/>
        <interrupt index="24" module-instance="TC0" name="TC1" header:alternate-name="TC0_CH1" caption="Timer/Counter 1" header:alternate-caption="Timer/Counter 0 Channel 1"/>
        <interrupt index="25" module-instance="TC0" name="TC2" header:alternate-name="TC0_CH2" caption="Timer/Counter 2" header:alternate-caption="Timer/Counter 0 Channel 2"/>
        <interrupt index="26" module-instance="TC1" name="TC3" header:alternate-name="TC1_CH0" caption="Timer/Counter 3" header:alternate-caption="Timer/Counter 1 Channel 0"/>
        <interrupt index="27" module-instance="TC1" name="TC4" header:alternate-name="TC1_CH1" caption="Timer/Counter 4" header:alternate-caption="Timer/Counter 1 Channel 1"/>
        <interrupt index="28" module-instance="TC1" name="TC5" header:alternate-name="TC1_CH2" caption="Timer/Counter 5" header:alternate-caption="Timer/Counter 1 Channel 2"/>
        <interrupt index="29" module-instance="ADC" name="ADC" caption="Analog To Digital Converter"/>
        <interrupt index="47" module-instance="UHP" name="UHP" caption="USB OHCI"/>
        <interrupt index="48" module-instance="UDP" name="UDP" caption="USB Device FS"/>
        <interrupt index="49" module-instance="CRCCU" name="CRCCU" caption="CRCCU"/>
      </interrupts>
      <interfaces>
        <interface type="samjtag" name="JTAG"/>
        <interface type="swd" name="SWD"/>
      </interfaces>
    </device>
  </devices>
  <modules>
    <module name="ADC" caption="Analog-to-Digital Converter" id="6489" version="Z">
      <register-group name="ADC">
        <register caption="Control Register" name="ADC_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="Software Reset" mask="0x00000001" name="SWRST"/>
          <bitfield caption="Start Conversion" mask="0x00000002" name="START"/>
          <bitfield caption="Comparison Restart" mask="0x00000010" name="CMPRST"/>
        </register>
        <register caption="Mode Register" name="ADC_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Trigger Enable" mask="0x00000001" name="TRGEN" values="ADC_MR__TRGEN"/>
          <bitfield caption="Trigger Selection" mask="0x0000000E" name="TRGSEL" values="ADC_MR__TRGSEL"/>
          <bitfield caption="Sleep Mode" mask="0x00000020" name="SLEEP" values="ADC_MR__SLEEP"/>
          <bitfield caption="Fast Wake Up" mask="0x00000040" name="FWUP" values="ADC_MR__FWUP"/>
          <bitfield caption="Free Run Mode" mask="0x00000080" name="FREERUN" values="ADC_MR__FREERUN"/>
          <bitfield caption="Prescaler Rate Selection" mask="0x0000FF00" name="PRESCAL"/>
          <bitfield caption="Start Up Time" mask="0x000F0000" name="STARTUP" values="ADC_MR__STARTUP"/>
          <bitfield caption="Analog Settling Time" mask="0x00300000" name="SETTLING" values="ADC_MR__SETTLING"/>
          <bitfield caption="Analog Change" mask="0x00800000" name="ANACH" values="ADC_MR__ANACH"/>
          <bitfield caption="Tracking Time" mask="0x0F000000" name="TRACKTIM"/>
          <bitfield caption="Transfer Period" mask="0x30000000" name="TRANSFER"/>
          <bitfield caption="Use Sequence Enable" mask="0x80000000" name="USEQ" values="ADC_MR__USEQ"/>
        </register>
