Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg55/atdf/ATSAMG55G19.atdf
        <register caption="Last Channel Compare Window Register" name="ADC_LCCWR" offset="0x38" rw="RW" size="4">
          <bitfield caption="Low Threshold" mask="0x00000FFF" name="LOWTHRES"/>
          <bitfield caption="High Threshold" mask="0x0FFF0000" name="HIGHTHRES"/>
        </register>
        <register caption="Overrun Status Register" name="ADC_OVER" offset="0x3C" rw="R" size="4">
          <bitfield caption="Overrun Error 0" mask="0x00000001" name="OVRE0"/>
          <bitfield caption="Overrun Error 1" mask="0x00000002" name="OVRE1"/>
          <bitfield caption="Overrun Error 2" mask="0x00000004" name="OVRE2"/>
          <bitfield caption="Overrun Error 3" mask="0x00000008" name="OVRE3"/>
          <bitfield caption="Overrun Error 4" mask="0x00000010" name="OVRE4"/>
          <bitfield caption="Overrun Error 5" mask="0x00000020" name="OVRE5"/>
          <bitfield caption="Overrun Error 6" mask="0x00000040" name="OVRE6"/>
          <bitfield caption="Overrun Error 7" mask="0x00000080" name="OVRE7"/>
        </register>
        <register caption="Extended Mode Register" name="ADC_EMR" offset="0x40" rw="RW" size="4">
          <bitfield caption="Comparison Mode" mask="0x00000003" name="CMPMODE" values="ADC_EMR__CMPMODE"/>
          <bitfield caption="Comparison Type" mask="0x00000004" name="CMPTYPE" values="ADC_EMR__CMPTYPE"/>
          <bitfield caption="Comparison Selected Channel" mask="0x000000F0" name="CMPSEL"/>
          <bitfield caption="Compare All Channels" mask="0x00000200" name="CMPALL"/>
          <bitfield caption="Compare Event Filtering" mask="0x00003000" name="CMPFILTER"/>
          <bitfield caption="Over Sampling Rate" mask="0x00070000" name="OSR" values="ADC_EMR__OSR"/>
          <bitfield caption="Averaging on Single Trigger Event" mask="0x00100000" name="ASTE" values="ADC_EMR__ASTE"/>
          <bitfield caption="External Clock Selection" mask="0x00200000" name="SRCCLK" values="ADC_EMR__SRCCLK"/>
          <bitfield caption="Tag of the ADC_LCDR" mask="0x01000000" name="TAG"/>
        </register>
        <register caption="Compare Window Register" name="ADC_CWR" offset="0x44" rw="RW" size="4">
          <bitfield caption="Low Threshold" mask="0x0000FFFF" name="LOWTHRES"/>
          <bitfield caption="High Threshold" mask="0xFFFF0000" name="HIGHTHRES"/>
        </register>
        <register caption="Channel Offset Register" name="ADC_COR" offset="0x4C" rw="RW" size="4">
          <bitfield caption="Offset for Channel 0" mask="0x00000001" name="OFF0"/>
          <bitfield caption="Offset for Channel 1" mask="0x00000002" name="OFF1"/>
          <bitfield caption="Offset for Channel 2" mask="0x00000004" name="OFF2"/>
          <bitfield caption="Offset for Channel 3" mask="0x00000008" name="OFF3"/>
          <bitfield caption="Offset for Channel 4" mask="0x00000010" name="OFF4"/>
          <bitfield caption="Offset for Channel 5" mask="0x00000020" name="OFF5"/>
          <bitfield caption="Offset for Channel 6" mask="0x00000040" name="OFF6"/>
          <bitfield caption="Offset for Channel 7" mask="0x00000080" name="OFF7"/>
          <bitfield caption="Differential Inputs for Channel 0" mask="0x00010000" name="DIFF0"/>
          <bitfield caption="Differential Inputs for Channel 1" mask="0x00020000" name="DIFF1"/>
          <bitfield caption="Differential Inputs for Channel 2" mask="0x00040000" name="DIFF2"/>
          <bitfield caption="Differential Inputs for Channel 3" mask="0x00080000" name="DIFF3"/>
          <bitfield caption="Differential Inputs for Channel 4" mask="0x00100000" name="DIFF4"/>
          <bitfield caption="Differential Inputs for Channel 5" mask="0x00200000" name="DIFF5"/>
          <bitfield caption="Differential Inputs for Channel 6" mask="0x00400000" name="DIFF6"/>
          <bitfield caption="Differential Inputs for Channel 7" mask="0x00800000" name="DIFF7"/>
        </register>
        <register caption="Channel Data Register 0" name="ADC_CDR" offset="0x50" rw="R" size="4" count="8">
          <bitfield caption="Converted Data" mask="0x0000FFFF" name="DATA"/>
        </register>
        <register caption="Analog Control Register" name="ADC_ACR" offset="0x94" rw="RW" size="4">
          <bitfield caption="ADC Auto-test modes" mask="0xC0000000" name="AUTOTEST" values="ADC_ACR__AUTOTEST"/>
        </register>
        <register caption="Write Protection Mode Register" name="ADC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="ADC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="ADC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Receive Pointer Register" name="ADC_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="ADC_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="ADC_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="ADC_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="ADC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="ADC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
      </register-group>
      <value-group caption="" name="ADC_MR__TRGEN">
        <value caption="Hardware triggers are disabled. Starting a conversion is only possible by software." name="DIS" value="0"/>
        <value caption="Hardware trigger selected by TRGSEL field is enabled." name="EN" value="1"/>
      </value-group>
      <value-group caption="" name="ADC_MR__TRGSEL">
        <value caption="ADTRG External trigger" name="ADC_TRIG0" value="0x0"/>
        <value caption="TIOA0 Output of the Timer Counter Channel 0" name="ADC_TRIG1" value="0x1"/>
        <value caption="TIOA1 Output of the Timer Counter Channel 1" name="ADC_TRIG2" value="0x2"/>
        <value caption="TIOA2 Output of the Timer Counter Channel 2" name="ADC_TRIG3" value="0x3"/>
        <value caption="RTCOUT0" name="ADC_TRIG4" value="0x4"/>
        <value caption="RTT 16-Bit prescaler output" name="ADC_TRIG5" value="0x5"/>
        <value caption="RTTEVENT" name="ADC_TRIG6" value="0x6"/>
        <value caption="-" name="ADC_TRIG7" value="0x7"/>
      </value-group>
