Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg55/atdf/ATSAMG55G19.atdf
    <module name="MEM2MEM" caption="Memory to Memory" id="11211" version="B">
      <register-group name="MEM2MEM">
        <register caption="Memory to Memory Transfer Holding Register" name="MEM2MEM_THR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Transfer Holding Data" mask="0xFFFFFFFF" name="THDATA"/>
        </register>
        <register caption="Memory to Memory Mode Register" name="MEM2MEM_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Transfer Size" mask="0x00000003" name="TSIZE" values="MEM2MEM_MR__TSIZE"/>
        </register>
        <register caption="Memory to Memory Interrupt Enable Register" name="MEM2MEM_IER" offset="0x08" rw="W" size="4" atomic-op="set:MEM2MEM_IMR">
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full Interrupt Enable" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Memory to Memory Interrupt Disable Register" name="MEM2MEM_IDR" offset="0x0C" rw="W" size="4" atomic-op="clear:MEM2MEM_IMR">
          <bitfield caption="End of Transfer Interrupt Disable" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full Interrupt Disable" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Memory to Memory Interrupt Mask Register" name="MEM2MEM_IMR" offset="0x10" rw="R" size="4" atomic-op="read:MEM2MEM_IMR">
          <bitfield caption="End of Transfer Interrupt Mask" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full Interrupt Mask" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Memory to Memory Interrupt Status Register" name="MEM2MEM_ISR" offset="0x14" rw="R" size="4" atomic-op="read:MEM2MEM_ISR">
          <bitfield caption="End of Transfer" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Receive Pointer Register" name="MEM2MEM_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="MEM2MEM_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="MEM2MEM_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="MEM2MEM_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="MEM2MEM_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="MEM2MEM_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="MEM2MEM_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="MEM2MEM_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="MEM2MEM_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="MEM2MEM_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
      </register-group>
      <value-group caption="" name="MEM2MEM_MR__TSIZE">
        <value caption="The buffer size is defined in byte." name="T_8BIT" value="0x0"/>
        <value caption="The buffer size is defined in half-word (16-bit)." name="T_16BIT" value="0x1"/>
        <value caption="The buffer size is defined in word (32-bit). Default value." name="T_32BIT" value="0x2"/>
      </value-group>
    </module>
    <module name="PDC" caption="Peripheral DMA Controller" id="6031" version="I">
      <register-group name="PDC">
        <register caption="Receive Pointer Register" name="PERIPH_RPR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="PERIPH_RCR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
