Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg55/atdf/ATSAMG55G19.atdf
        <register caption="Write Protection Mode Register" name="PDMIC_WPMR" offset="0xE4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protect Key" mask="0xFFFFFF00" name="WPKEY" values="PDMIC_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="PDMIC_WPSR" offset="0xE8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Receive Pointer Register" name="PDMIC_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="PDMIC_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="PDMIC_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="PDMIC_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="PDMIC_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="PDMIC_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
      </register-group>
      <value-group caption="" name="PDMIC_DSPR0__OSR">
        <value caption="Oversampling ratio is 128" name="_128" value="0"/>
        <value caption="Oversampling ratio is 64" name="_64" value="1"/>
      </value-group>
      <value-group caption="" name="PDMIC_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0." name="PASSWD" value="0x414443"/>
      </value-group>
    </module>
    <module name="PIO" caption="Parallel Input/Output Controller" id="11004" version="T">
      <register-group name="PIO">
        <register caption="Enable Register" name="PIO_PER" offset="0x0000" rw="W" size="4" atomic-op="set:PIO_PSR">
          <bitfield caption="Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Disable Register" name="PIO_PDR" offset="0x0004" rw="W" size="4" atomic-op="clear:PIO_PSR">
          <bitfield caption="Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Status Register" name="PIO_PSR" offset="0x0008" rw="R" size="4">
          <bitfield caption="Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Enable Register" name="PIO_OER" offset="0x0010" rw="W" size="4" atomic-op="set:PIO_OSR">
          <bitfield caption="Output Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Disable Register" name="PIO_ODR" offset="0x0014" rw="W" size="4" atomic-op="clear:PIO_OSR">
          <bitfield caption="Output Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Status Register" name="PIO_OSR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Output Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Glitch Input Filter Enable Register" name="PIO_IFER" offset="0x0020" rw="W" size="4" atomic-op="set:PIO_IFSR">
          <bitfield caption="Input Filter Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Filter Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Filter Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Filter Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Filter Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Filter Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Filter Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Filter Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Filter Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Filter Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Filter Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Filter Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Filter Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Filter Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Filter Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Filter Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Filter Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Filter Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Filter Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Filter Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Filter Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Filter Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Filter Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Filter Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Filter Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Filter Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Filter Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Filter Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Filter Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Filter Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Filter Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Filter Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Glitch Input Filter Disable Register" name="PIO_IFDR" offset="0x0024" rw="W" size="4" atomic-op="clear:PIO_IFSR">
          <bitfield caption="Input Filter Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Filter Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Filter Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Filter Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Filter Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Filter Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Filter Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Filter Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Filter Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Filter Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Filter Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Filter Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Filter Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Filter Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Filter Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Filter Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Filter Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Filter Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Filter Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Filter Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Filter Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Filter Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Filter Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Filter Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Filter Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Filter Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Filter Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Filter Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Filter Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Filter Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Filter Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Filter Disable" mask="0x80000000" name="P31"/>
        </register>
