Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg55/atdf/ATSAMG55G19.atdf
        <register caption="Falling Edge/Low-Level Select Register" name="PIO_FELLSR" offset="0x00D0" rw="W" size="4" atomic-op="clear:PIO_FRLHSR">
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00000001" name="P0"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00000002" name="P1"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00000004" name="P2"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00000008" name="P3"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00000010" name="P4"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00000020" name="P5"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00000040" name="P6"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00000080" name="P7"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00000100" name="P8"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00000200" name="P9"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00000400" name="P10"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00000800" name="P11"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00001000" name="P12"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00002000" name="P13"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00004000" name="P14"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00008000" name="P15"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00010000" name="P16"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00020000" name="P17"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00040000" name="P18"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00080000" name="P19"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00100000" name="P20"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00200000" name="P21"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00400000" name="P22"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x00800000" name="P23"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x01000000" name="P24"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x02000000" name="P25"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x04000000" name="P26"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x08000000" name="P27"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x10000000" name="P28"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x20000000" name="P29"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x40000000" name="P30"/>
          <bitfield caption="Falling Edge/Low-Level Interrupt Selection" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Rising Edge/High-Level Select Register" name="PIO_REHLSR" offset="0x00D4" rw="W" size="4" atomic-op="set:PIO_FRLHSR">
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00000001" name="P0"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00000002" name="P1"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00000004" name="P2"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00000008" name="P3"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00000010" name="P4"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00000020" name="P5"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00000040" name="P6"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00000080" name="P7"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00000100" name="P8"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00000200" name="P9"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00000400" name="P10"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00000800" name="P11"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00001000" name="P12"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00002000" name="P13"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00004000" name="P14"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00008000" name="P15"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00010000" name="P16"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00020000" name="P17"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00040000" name="P18"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00080000" name="P19"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00100000" name="P20"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00200000" name="P21"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00400000" name="P22"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x00800000" name="P23"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x01000000" name="P24"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x02000000" name="P25"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x04000000" name="P26"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x08000000" name="P27"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x10000000" name="P28"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x20000000" name="P29"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x40000000" name="P30"/>
          <bitfield caption="Rising Edge/High-Level Interrupt Selection" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Fall/Rise - Low/High Status Register" name="PIO_FRLHSR" offset="0x00D8" rw="R" size="4">
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00000001" name="P0"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00000002" name="P1"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00000004" name="P2"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00000008" name="P3"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00000010" name="P4"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00000020" name="P5"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00000040" name="P6"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00000080" name="P7"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00000100" name="P8"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00000200" name="P9"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00000400" name="P10"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00000800" name="P11"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00001000" name="P12"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00002000" name="P13"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00004000" name="P14"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00008000" name="P15"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00010000" name="P16"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00020000" name="P17"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00040000" name="P18"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00080000" name="P19"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00100000" name="P20"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00200000" name="P21"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00400000" name="P22"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x00800000" name="P23"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x01000000" name="P24"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x02000000" name="P25"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x04000000" name="P26"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x08000000" name="P27"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x10000000" name="P28"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x20000000" name="P29"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x40000000" name="P30"/>
          <bitfield caption="Edge/Level Interrupt Source Selection" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Write Protection Mode Register" name="PIO_WPMR" offset="0x00E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="PIO_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="PIO_WPSR" offset="0x00E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="Schmitt Trigger Register" name="PIO_SCHMITT" offset="0x0100" rw="RW" size="4">
          <bitfield caption="Schmitt Trigger Control" mask="0x00000001" name="SCHMITT0"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000002" name="SCHMITT1"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000004" name="SCHMITT2"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000008" name="SCHMITT3"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000010" name="SCHMITT4"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000020" name="SCHMITT5"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000040" name="SCHMITT6"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000080" name="SCHMITT7"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000100" name="SCHMITT8"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000200" name="SCHMITT9"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000400" name="SCHMITT10"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00000800" name="SCHMITT11"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00001000" name="SCHMITT12"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00002000" name="SCHMITT13"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00004000" name="SCHMITT14"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00008000" name="SCHMITT15"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00010000" name="SCHMITT16"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00020000" name="SCHMITT17"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00040000" name="SCHMITT18"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00080000" name="SCHMITT19"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00100000" name="SCHMITT20"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00200000" name="SCHMITT21"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00400000" name="SCHMITT22"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x00800000" name="SCHMITT23"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x01000000" name="SCHMITT24"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x02000000" name="SCHMITT25"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x04000000" name="SCHMITT26"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x08000000" name="SCHMITT27"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x10000000" name="SCHMITT28"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x20000000" name="SCHMITT29"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x40000000" name="SCHMITT30"/>
          <bitfield caption="Schmitt Trigger Control" mask="0x80000000" name="SCHMITT31"/>
        </register>
        <register caption="I/O Drive Register" name="PIO_DRIVER" offset="0x0110" rw="RW" size="4">
          <bitfield caption="Drive of Line 0" mask="0x00000001" name="LINE0" values="PIO_DRIVER__LINE0"/>
          <bitfield caption="Drive of Line 1" mask="0x00000002" name="LINE1" values="PIO_DRIVER__LINE1"/>
          <bitfield caption="Drive of Line 2" mask="0x00000004" name="LINE2" values="PIO_DRIVER__LINE2"/>
          <bitfield caption="Drive of Line 3" mask="0x00000008" name="LINE3" values="PIO_DRIVER__LINE3"/>
          <bitfield caption="Drive of Line 4" mask="0x00000010" name="LINE4" values="PIO_DRIVER__LINE4"/>
          <bitfield caption="Drive of Line 5" mask="0x00000020" name="LINE5" values="PIO_DRIVER__LINE5"/>
          <bitfield caption="Drive of Line 6" mask="0x00000040" name="LINE6" values="PIO_DRIVER__LINE6"/>
          <bitfield caption="Drive of Line 7" mask="0x00000080" name="LINE7" values="PIO_DRIVER__LINE7"/>
          <bitfield caption="Drive of Line 8" mask="0x00000100" name="LINE8" values="PIO_DRIVER__LINE8"/>
          <bitfield caption="Drive of Line 9" mask="0x00000200" name="LINE9" values="PIO_DRIVER__LINE9"/>
          <bitfield caption="Drive of Line 10" mask="0x00000400" name="LINE10" values="PIO_DRIVER__LINE10"/>
          <bitfield caption="Drive of Line 11" mask="0x00000800" name="LINE11" values="PIO_DRIVER__LINE11"/>
          <bitfield caption="Drive of Line 12" mask="0x00001000" name="LINE12" values="PIO_DRIVER__LINE12"/>
          <bitfield caption="Drive of Line 13" mask="0x00002000" name="LINE13" values="PIO_DRIVER__LINE13"/>
          <bitfield caption="Drive of Line 14" mask="0x00004000" name="LINE14" values="PIO_DRIVER__LINE14"/>
          <bitfield caption="Drive of Line 15" mask="0x00008000" name="LINE15" values="PIO_DRIVER__LINE15"/>
          <bitfield caption="Drive of Line 16" mask="0x00010000" name="LINE16" values="PIO_DRIVER__LINE16"/>
          <bitfield caption="Drive of Line 17" mask="0x00020000" name="LINE17" values="PIO_DRIVER__LINE17"/>
          <bitfield caption="Drive of Line 18" mask="0x00040000" name="LINE18" values="PIO_DRIVER__LINE18"/>
          <bitfield caption="Drive of Line 19" mask="0x00080000" name="LINE19" values="PIO_DRIVER__LINE19"/>
          <bitfield caption="Drive of Line 20" mask="0x00100000" name="LINE20" values="PIO_DRIVER__LINE20"/>
          <bitfield caption="Drive of Line 21" mask="0x00200000" name="LINE21" values="PIO_DRIVER__LINE21"/>
          <bitfield caption="Drive of Line 22" mask="0x00400000" name="LINE22" values="PIO_DRIVER__LINE22"/>
          <bitfield caption="Drive of Line 23" mask="0x00800000" name="LINE23" values="PIO_DRIVER__LINE23"/>
          <bitfield caption="Drive of Line 24" mask="0x01000000" name="LINE24" values="PIO_DRIVER__LINE24"/>
          <bitfield caption="Drive of Line 25" mask="0x02000000" name="LINE25" values="PIO_DRIVER__LINE25"/>
          <bitfield caption="Drive of Line 26" mask="0x04000000" name="LINE26" values="PIO_DRIVER__LINE26"/>
          <bitfield caption="Drive of Line 27" mask="0x08000000" name="LINE27" values="PIO_DRIVER__LINE27"/>
          <bitfield caption="Drive of Line 28" mask="0x10000000" name="LINE28" values="PIO_DRIVER__LINE28"/>
          <bitfield caption="Drive of Line 29" mask="0x20000000" name="LINE29" values="PIO_DRIVER__LINE29"/>
          <bitfield caption="Drive of Line 30" mask="0x40000000" name="LINE30" values="PIO_DRIVER__LINE30"/>
          <bitfield caption="Drive of Line 31" mask="0x80000000" name="LINE31" values="PIO_DRIVER__LINE31"/>
        </register>
      </register-group>
