Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg55/atdf/ATSAMG55G19.atdf
        <register caption="Supply Controller Status Register" name="SUPC_SR" offset="0x14" rw="R" size="4">
          <bitfield caption="WKUP Wake-up Status (cleared on read)" mask="0x00000002" name="WKUPS" values="SUPC_SR__WKUPS"/>
          <bitfield caption="Brownout Detector Reset Status (cleared on read)" mask="0x00000008" name="BODRSTS" values="SUPC_SR__BODRSTS"/>
          <bitfield caption="Supply Monitor Reset Status (cleared on read)" mask="0x00000010" name="SMRSTS" values="SUPC_SR__SMRSTS"/>
          <bitfield caption="Supply Monitor Status (cleared on read)" mask="0x00000020" name="SMS" values="SUPC_SR__SMS"/>
          <bitfield caption="Supply Monitor Output Status" mask="0x00000040" name="SMOS" values="SUPC_SR__SMOS"/>
          <bitfield caption="32-kHz Oscillator Selection Status" mask="0x00000080" name="OSCSEL" values="SUPC_SR__OSCSEL"/>
          <bitfield caption="Low-power Debouncer Wake-up Status on WKUP0 (cleared on read)" mask="0x00002000" name="LPDBCS0" values="SUPC_SR__LPDBCS0"/>
          <bitfield caption="Low-power Debouncer Wake-up Status on WKUP1 (cleared on read)" mask="0x00004000" name="LPDBCS1" values="SUPC_SR__LPDBCS1"/>
          <bitfield caption="WKUP Input Status 0 (cleared on read)" mask="0x00010000" name="WKUPIS0" values="SUPC_SR__WKUPIS0"/>
          <bitfield caption="WKUP Input Status 1 (cleared on read)" mask="0x00020000" name="WKUPIS1" values="SUPC_SR__WKUPIS1"/>
          <bitfield caption="WKUP Input Status 2 (cleared on read)" mask="0x00040000" name="WKUPIS2" values="SUPC_SR__WKUPIS2"/>
          <bitfield caption="WKUP Input Status 3 (cleared on read)" mask="0x00080000" name="WKUPIS3" values="SUPC_SR__WKUPIS3"/>
          <bitfield caption="WKUP Input Status 4 (cleared on read)" mask="0x00100000" name="WKUPIS4" values="SUPC_SR__WKUPIS4"/>
          <bitfield caption="WKUP Input Status 5 (cleared on read)" mask="0x00200000" name="WKUPIS5" values="SUPC_SR__WKUPIS5"/>
          <bitfield caption="WKUP Input Status 6 (cleared on read)" mask="0x00400000" name="WKUPIS6" values="SUPC_SR__WKUPIS6"/>
          <bitfield caption="WKUP Input Status 7 (cleared on read)" mask="0x00800000" name="WKUPIS7" values="SUPC_SR__WKUPIS7"/>
          <bitfield caption="WKUP Input Status 8 (cleared on read)" mask="0x01000000" name="WKUPIS8" values="SUPC_SR__WKUPIS8"/>
          <bitfield caption="WKUP Input Status 9 (cleared on read)" mask="0x02000000" name="WKUPIS9" values="SUPC_SR__WKUPIS9"/>
          <bitfield caption="WKUP Input Status 10 (cleared on read)" mask="0x04000000" name="WKUPIS10" values="SUPC_SR__WKUPIS10"/>
          <bitfield caption="WKUP Input Status 11 (cleared on read)" mask="0x08000000" name="WKUPIS11" values="SUPC_SR__WKUPIS11"/>
          <bitfield caption="WKUP Input Status 12 (cleared on read)" mask="0x10000000" name="WKUPIS12" values="SUPC_SR__WKUPIS12"/>
          <bitfield caption="WKUP Input Status 13 (cleared on read)" mask="0x20000000" name="WKUPIS13" values="SUPC_SR__WKUPIS13"/>
          <bitfield caption="WKUP Input Status 14 (cleared on read)" mask="0x40000000" name="WKUPIS14" values="SUPC_SR__WKUPIS14"/>
          <bitfield caption="WKUP Input Status 15 (cleared on read)" mask="0x80000000" name="WKUPIS15" values="SUPC_SR__WKUPIS15"/>
        </register>
        <register caption="Supply Controller Power Mode Register" name="SUPC_PWMR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Low Power Value Selection" mask="0x00000001" name="LPOWERS" values="SUPC_PWMR__LPOWERS"/>
          <bitfield caption="Low Power Value" mask="0x00000002" name="LPOWER0"/>
          <bitfield caption="Low Power Value" mask="0x00000004" name="LPOWER1"/>
          <bitfield caption="Low Power Value" mask="0x00000008" name="LPOWER2"/>
          <bitfield caption="Low Power Value" mask="0x00000010" name="LPOWER3"/>
          <bitfield caption="Start-up Time when Resuming from Wait Mode" mask="0x00000080" name="STUPTIME" values="SUPC_PWMR__STUPTIME"/>
          <bitfield caption="Enhanced Custom Power Value Selection" mask="0x00000100" name="ECPWRS" values="SUPC_PWMR__ECPWRS"/>
          <bitfield caption="Enhanced Custom Power Value" mask="0x00000200" name="ECPWR0"/>
          <bitfield caption="Enhanced Custom Power Value" mask="0x00000400" name="ECPWR1"/>
          <bitfield caption="Enhanced Custom Power Value" mask="0x00000800" name="ECPWR2"/>
          <bitfield caption="Enhanced Custom Power Value" mask="0x00001000" name="ECPWR3"/>
          <bitfield caption="SRAM Power Control" mask="0x00010000" name="SRAM0ON" values="SUPC_PWMR__SRAM0ON"/>
          <bitfield caption="SRAM Power Control" mask="0x00020000" name="SRAM1ON" values="SUPC_PWMR__SRAM1ON"/>
          <bitfield caption="SRAM Power Control" mask="0x00040000" name="SRAM2ON" values="SUPC_PWMR__SRAM2ON"/>
          <bitfield caption="SRAM Power Control" mask="0x00080000" name="SRAM3ON" values="SUPC_PWMR__SRAM3ON"/>
          <bitfield caption="SRAM Power Control" mask="0x00100000" name="SRAM4ON" values="SUPC_PWMR__SRAM4ON"/>
          <bitfield caption="SRAM Power Control" mask="0x00200000" name="SRAM5ON" values="SUPC_PWMR__SRAM5ON"/>
          <bitfield caption="SRAM Power Control" mask="0x00400000" name="SRAM6ON" values="SUPC_PWMR__SRAM6ON"/>
          <bitfield caption="Dual-port RAM Power Control" mask="0x00800000" name="DPRAMON" values="SUPC_PWMR__DPRAMON"/>
          <bitfield caption="Password Key" mask="0xFF000000" name="KEY" values="SUPC_PWMR__KEY"/>
        </register>
      </register-group>
      <value-group caption="" name="SUPC_CR__VROFF">
        <value caption="No effect." name="NO_EFFECT" value="0"/>
        <value caption="If KEY is correct, asserts the system reset signal and stops the voltage regulator." name="STOP_VREG" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_CR__XTALSEL">
        <value caption="No effect." name="NO_EFFECT" value="0"/>
        <value caption="If KEY is correct, switches the slow clock on the crystal oscillator output." name="CRYSTAL_SEL" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_CR__KEY">
        <value caption="Writing any other value in this field aborts the write operation.Always reads as 0." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMTH">
        <value caption="1.6 V" name="V1P6" value="0x0"/>
        <value caption="1.72 V" name="V1P72" value="0x1"/>
        <value caption="1.84 V" name="V1P84" value="0x2"/>
        <value caption="1.96 V" name="V1P96" value="0x3"/>
        <value caption="2.08 V" name="V2P08" value="0x4"/>
        <value caption="2.2 V" name="V2P2" value="0x5"/>
        <value caption="2.32 V" name="V2P32" value="0x6"/>
        <value caption="2.44 V" name="V2P44" value="0x7"/>
        <value caption="2.56 V" name="V2P56" value="0x8"/>
        <value caption="2.68 V" name="V2P68" value="0x9"/>
        <value caption="2.8 V" name="V2P8" value="0xA"/>
        <value caption="2.92 V" name="V2P92" value="0xB"/>
        <value caption="3.04 V" name="V3P04" value="0xC"/>
        <value caption="3.16 V" name="V3P16" value="0xD"/>
        <value caption="3.28 V" name="V3P28" value="0xE"/>
        <value caption="3.4 V" name="V3P4" value="0xF"/>
      </value-group>
