Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg55/atdf/ATSAMG55G19.atdf
        <register caption="Receive Pointer Register" name="TC_RPR0" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="TC_RNPR0" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="TC_RNCR0" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="TC_PTCR0" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="TC_PTSR0" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
      </register-group>
      <value-group caption="" name="TC_CMR0__TCCLKS">
        <value caption="Clock selected: internal PCK3 clock signal (from PMC)" name="TIMER_CLOCK1" value="0x0"/>
        <value caption="Clock selected: internal MCK/8 clock signal (from PMC)" name="TIMER_CLOCK2" value="0x1"/>
        <value caption="Clock selected: internal MCK/32 clock signal (from PMC)" name="TIMER_CLOCK3" value="0x2"/>
        <value caption="Clock selected: internal MCK/128 clock signal (from PMC)" name="TIMER_CLOCK4" value="0x3"/>
        <value caption="Clock selected: internal SLCK clock signal (from PMC)" name="TIMER_CLOCK5" value="0x4"/>
        <value caption="Clock selected: XC0" name="XC0" value="0x5"/>
        <value caption="Clock selected: XC1" name="XC1" value="0x6"/>
        <value caption="Clock selected: XC2" name="XC2" value="0x7"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__BURST">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="XC0 is ANDed with the selected clock." name="XC0" value="0x1"/>
        <value caption="XC1 is ANDed with the selected clock." name="XC1" value="0x2"/>
        <value caption="XC2 is ANDed with the selected clock." name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__ETRGEDG">
        <value caption="The clock is not gated by an external signal." name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edge" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__LDRA">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOAx" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOAx" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOAx" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__LDRB">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge of TIOAx" name="RISING" value="0x1"/>
        <value caption="Falling edge of TIOAx" name="FALLING" value="0x2"/>
        <value caption="Each edge of TIOAx" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__SBSMPLR">
        <value caption="Load a Capture Register each selected edge" name="ONE" value="0x0"/>
        <value caption="Load a Capture Register every 2 selected edges" name="HALF" value="0x1"/>
        <value caption="Load a Capture Register every 4 selected edges" name="FOURTH" value="0x2"/>
        <value caption="Load a Capture Register every 8 selected edges" name="EIGHTH" value="0x3"/>
        <value caption="Load a Capture Register every 16 selected edges" name="SIXTEENTH" value="0x4"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__EEVTEDG">
        <value caption="None" name="NONE" value="0x0"/>
        <value caption="Rising edge" name="RISING" value="0x1"/>
        <value caption="Falling edge" name="FALLING" value="0x2"/>
        <value caption="Each edges" name="EDGE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__EEVT">
        <value caption="TIOB" name="TIOB" value="0x0"/>
        <value caption="XC0" name="XC0" value="0x1"/>
        <value caption="XC1" name="XC1" value="0x2"/>
        <value caption="XC2" name="XC2" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__WAVSEL">
        <value caption="UP mode without automatic trigger on RC Compare" name="UP" value="0x0"/>
        <value caption="UPDOWN mode without automatic trigger on RC Compare" name="UPDOWN" value="0x1"/>
        <value caption="UP mode with automatic trigger on RC Compare" name="UP_RC" value="0x2"/>
        <value caption="UPDOWN mode with automatic trigger on RC Compare" name="UPDOWN_RC" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__ACPA">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__ACPC">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__AEEVT">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__ASWTRG">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__BCPB">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
      <value-group caption="" name="TC_CMR0__BCPC">
        <value caption="NONE" name="NONE" value="0x0"/>
        <value caption="SET" name="SET" value="0x1"/>
        <value caption="CLEAR" name="CLEAR" value="0x2"/>
        <value caption="TOGGLE" name="TOGGLE" value="0x3"/>
      </value-group>
