Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg55/atdf/ATSAMG55G19.atdf
        <register caption="SleepWalking Matching Register" name="TWI_SWMR" offset="0x04C" rw="RW" size="4">
          <bitfield caption="Slave Address 1" mask="0x0000007F" name="SADR1"/>
          <bitfield caption="Slave Address 2" mask="0x00007F00" name="SADR2"/>
          <bitfield caption="Slave Address 3" mask="0x007F0000" name="SADR3"/>
          <bitfield caption="Data Match" mask="0xFF000000" name="DATAM"/>
        </register>
        <register caption="Write Protection Mode Register" name="TWI_WPMR" offset="0x0E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="TWI_WPMR__WPKEY"/>
        </register>
        <register caption="Write Protection Status Register" name="TWI_WPSR" offset="0x0E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0xFFFFFF00" name="WPVSRC"/>
        </register>
        <register caption="Receive Pointer Register" name="TWI_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="TWI_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="TWI_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="TWI_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="TWI_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="TWI_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="TWI_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="TWI_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="TWI_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Receiver Circular Buffer Disable" mask="0x00020000" name="RXCBDIS"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Disable" mask="0x00080000" name="TXCBDIS"/>
          <bitfield caption="Transfer Bus Error Clear" mask="0x01000000" name="ERRCLR"/>
        </register>
        <register caption="Transfer Status Register" name="TWI_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Receiver Circular Buffer Enable" mask="0x00010000" name="RXCBEN"/>
          <bitfield caption="Transmitter Circular Buffer Enable" mask="0x00040000" name="TXCBEN"/>
          <bitfield caption="Transfer Bus Error" mask="0x01000000" name="ERR"/>
        </register>
      </register-group>
      <value-group caption="" name="TWI_MMR__IADRSZ">
        <value caption="No internal device address" name="NONE" value="0x0"/>
        <value caption="One-byte internal device address" name="_1_BYTE" value="0x1"/>
        <value caption="Two-byte internal device address" name="_2_BYTE" value="0x2"/>
        <value caption="Three-byte internal device address" name="_3_BYTE" value="0x3"/>
      </value-group>
      <value-group caption="Bit Rate Source Clock" name="TWI_CWGR__BRSRCCLK">
        <value caption="The peripheral clock is the source clock for the bit rate generation." name="PERIPH_CLK" value="0"/>
        <value caption="Programmable clock is the source clock for the bit rate generation, thus the bit rate can be independent of the core/peripheral clock." name="PCK" value="1"/>
      </value-group>
      <value-group caption="" name="TWI_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0" name="PASSWD" value="0x545749"/>
      </value-group>
    </module>
    <module name="UDP" caption="USB Device Port" id="6083" version="Y">
      <register-group name="UDP">
        <register caption="Frame Number Register" name="UDP_FRM_NUM" offset="0x000" rw="R" size="4">
          <bitfield caption="Frame Number as Defined in the Packet Field Formats" mask="0x000007FF" name="FRM_NUM"/>
          <bitfield caption="Frame Error" mask="0x00010000" name="FRM_ERR"/>
          <bitfield caption="Frame OK" mask="0x00020000" name="FRM_OK"/>
        </register>
        <register caption="Global State Register" name="UDP_GLB_STAT" offset="0x004" rw="RW" size="4">
          <bitfield caption="Function Address Enable" mask="0x00000001" name="FADDEN"/>
          <bitfield caption="Configured" mask="0x00000002" name="CONFG"/>
          <bitfield caption="Enable Send Resume" mask="0x00000004" name="ESR"/>
          <bitfield mask="0x00000008" name="RSMINPR"/>
          <bitfield caption="Remote Wakeup Enable" mask="0x00000010" name="RMWUPE"/>
        </register>
        <register caption="Function Address Register" name="UDP_FADDR" offset="0x008" rw="RW" size="4">
          <bitfield caption="Function Address Value" mask="0x0000007F" name="FADD"/>
          <bitfield caption="Function Enable" mask="0x00000100" name="FEN"/>
        </register>
