Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg55/atdf/ATSAMG55G19.atdf
        <register caption="Transceiver Control Register" name="UDP_TXVC" offset="0x074" rw="RW" size="4">
          <bitfield caption="Transceiver Disable" mask="0x00000100" name="TXVDIS"/>
          <bitfield caption="Pull-up On" mask="0x00000200" name="PUON"/>
        </register>
      </register-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
      <value-group caption="" name="UDP_CSR__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous OUT" name="ISO_OUT" value="0x1"/>
        <value caption="Bulk OUT" name="BULK_OUT" value="0x2"/>
        <value caption="Interrupt OUT" name="INT_OUT" value="0x3"/>
        <value caption="Isochronous IN" name="ISO_IN" value="0x5"/>
        <value caption="Bulk IN" name="BULK_IN" value="0x6"/>
        <value caption="Interrupt IN" name="INT_IN" value="0x7"/>
      </value-group>
    </module>
    <module name="UHP" caption="USB Host Port" id="6127" version="G">
      <register-group name="UHP">
        <register caption="OHCI Revision Number Register" name="UHP_HCREVISION" offset="0x00" rw="R" size="4">
          <bitfield caption="OHCI revision number" mask="0x000000FF" name="REV"/>
        </register>
        <register caption="HC Operating Mode Register" name="UHP_HCCONTROL" offset="0x04" rw="RW" size="4">
          <bitfield caption="Control/bulk service ratio" mask="0x00000003" name="CBSR"/>
          <bitfield caption="Periodic list enable" mask="0x00000004" name="PLE"/>
          <bitfield caption="Isochronous enable" mask="0x00000008" name="IE"/>
          <bitfield caption="Control list enable" mask="0x00000010" name="CLE"/>
          <bitfield caption="Bulk list enable" mask="0x00000020" name="BLE"/>
          <bitfield caption="Host controller functional state" mask="0x000000C0" name="HCFS"/>
          <bitfield caption="Interrupt routing" mask="0x00000100" name="IR"/>
          <bitfield caption="Remote wake-up connected" mask="0x00000200" name="RWC"/>
          <bitfield caption="Remote wake-up enable" mask="0x00000400" name="RWE"/>
        </register>
        <register caption="HC Command and Status Register" name="UHP_HCCOMMANDSTATUS" offset="0x08" rw="RW" size="4">
          <bitfield caption="Host controller reset (read/write)" mask="0x00000001" name="HCR"/>
          <bitfield caption="Control list filled (read/write)" mask="0x00000002" name="CLF"/>
          <bitfield caption="Bulk list filled (read/write)" mask="0x00000004" name="BLF"/>
          <bitfield caption="Ownership change request (read/write)" mask="0x00000008" name="OCR"/>
          <bitfield caption="Scheduling overrun count (read-only)" mask="0x00030000" name="SOC"/>
        </register>
        <register caption="HC Interrupt and Status Register" name="UHP_HCINTERRUPTSTATUS" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Scheduling overrun (read/write, write '1' to clear)" mask="0x00000001" name="SO"/>
          <bitfield caption="Write done head (read/write, write '1' to clear)" mask="0x00000002" name="WDH"/>
          <bitfield caption="Start of frame (read/write, write '1' to clear)" mask="0x00000004" name="SF"/>
          <bitfield caption="Resume detected (read/write, write '1' to clear)" mask="0x00000008" name="RD"/>
          <bitfield caption="Unrecoverable error (read/write, write '1' to clear)" mask="0x00000010" name="UE"/>
          <bitfield caption="Frame number overflow (read/write, write '1' to clear)" mask="0x00000020" name="FNO"/>
          <bitfield caption="Root hub status change (read/write, write '1' to clear)" mask="0x00000040" name="RHSC"/>
          <bitfield caption="Ownership change (read-only)" mask="0x40000000" name="OC"/>
        </register>
