Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.8.197/samg55/atdf/ATSAMG55G19.atdf
        <register caption="HC Interrupt Enable Register" name="UHP_HCINTERRUPTENABLE" offset="0x10" rw="RW" size="4">
          <bitfield caption="Scheduling overrun (read/write, write '1' to set)" mask="0x00000001" name="SO"/>
          <bitfield caption="Write done head (read/write, write '1' to set)" mask="0x00000002" name="WDH"/>
          <bitfield caption="Start of frame (read/write, write '1' to set)" mask="0x00000004" name="SF"/>
          <bitfield caption="Resume detected (read/write, write '1' to set)" mask="0x00000008" name="RD"/>
          <bitfield caption="Unrecoverable error (read/write, write '1' to set)" mask="0x00000010" name="UE"/>
          <bitfield caption="Frame number overflow (read/write, write '1' to set)" mask="0x00000020" name="FNO"/>
          <bitfield caption="Root hub status change (read/write, write '1' to set)" mask="0x00000040" name="RHSC"/>
          <bitfield caption="Ownership change (read-only)" mask="0x40000000" name="OC"/>
          <bitfield caption="Master interrupt enable (read/write, write '1' to set)" mask="0x80000000" name="MIE"/>
        </register>
        <register caption="HC Interrupt Disable Register" name="UHP_HCINTERRUPTDISABLE" offset="0x14" rw="RW" size="4">
          <bitfield caption="Scheduling overrun (read/write)" mask="0x00000001" name="SO"/>
          <bitfield caption="Write done head (read/write)" mask="0x00000002" name="WDH"/>
          <bitfield caption="Start of frame (read/write)" mask="0x00000004" name="SF"/>
          <bitfield caption="Resume detected (read/write)" mask="0x00000008" name="RD"/>
          <bitfield caption="Unrecoverable error (read/write)" mask="0x00000010" name="UE"/>
          <bitfield caption="Frame number overflow (read/write)" mask="0x00000020" name="FNO"/>
          <bitfield caption="Root hub status change (read/write)" mask="0x00000040" name="RHSC"/>
          <bitfield caption="Ownership change (read-only)" mask="0x40000000" name="OC"/>
          <bitfield caption="Master interrupt enable (read/write)" mask="0x80000000" name="MIE"/>
        </register>
        <register caption="HC HCCA Address Register" name="UHP_HCHCCA" offset="0x18" rw="RW" size="4">
          <bitfield caption="Physical address of the beginning of the HCCA" mask="0xFFFFFF00" name="HCCA"/>
        </register>
        <register caption="HC Current Periodic Register" name="UHP_HCPERIODCURRENTED" offset="0x1C" rw="R" size="4">
          <bitfield caption="Physical address of the current ED on the periodic ED list" mask="0xFFFFFFF0" name="PCED"/>
        </register>
        <register caption="HC Head Control Register" name="UHP_HCCONTROLHEADED" offset="0x20" rw="RW" size="4">
          <bitfield caption="Physical address of the head ED on the control ED list" mask="0xFFFFFFF0" name="CHED"/>
        </register>
        <register caption="HC Current Control Register" name="UHP_HCCONTROLCURRENTED" offset="0x24" rw="RW" size="4">
          <bitfield caption="Physical address of the current ED on the control ED list" mask="0xFFFFFFF0" name="CCED"/>
        </register>
        <register caption="HC Head Bulk Register" name="UHP_HCBULKHEADED" offset="0x28" rw="RW" size="4">
          <bitfield caption="Physical address of the head ED on the bulk ED list" mask="0xFFFFFFF0" name="BHED"/>
        </register>
        <register caption="HC Current Bulk Register" name="UHP_HCBULKCURRENTED" offset="0x2C" rw="RW" size="4">
          <bitfield caption="Physical address of the current ED on the bulk ED list" mask="0xFFFFFFF0" name="BCED"/>
        </register>
        <register caption="HC Head Done Register" name="UHP_HCDONEHEAD" offset="0x30" rw="R" size="4">
          <bitfield caption="Physical address of the last TD that has added to the done queue" mask="0xFFFFFFF0" name="DH"/>
        </register>
        <register caption="HC Frame Interval Register" name="UHP_HCFMINTERVAL" offset="0x34" rw="RW" size="4">
          <bitfield caption="Frame interval" mask="0x00003FFF" name="FRAMEINTERVAL"/>
          <bitfield caption="Largest data packet" mask="0x7FFF0000" name="FSMPS"/>
          <bitfield caption="Frame interval toggle" mask="0x80000000" name="FIT"/>
        </register>
        <register caption="HC Frame Remaining Register" name="UHP_HCFMREMAINING" offset="0x38" rw="R" size="4">
          <bitfield caption="Frame remaining" mask="0x00003FFF" name="FR"/>
          <bitfield caption="Frame remaining toggle" mask="0x80000000" name="FRT"/>
        </register>
        <register caption="HC Frame Number Register" name="UHP_HCFMNUMBER" offset="0x3C" rw="R" size="4">
          <bitfield caption="Frame number" mask="0x0000FFFF" name="FN"/>
        </register>
        <register caption="HC Periodic Start Register" name="UHP_HCPERIODICSTART" offset="0x40" rw="RW" size="4">
          <bitfield caption="Periodic start" mask="0x00003FFF" name="PS"/>
        </register>
        <register caption="HC Low-Speed Threshold Register" name="UHP_HCLSTHRESHOLD" offset="0x44" rw="RW" size="4">
          <bitfield caption="Low-speed threshold" mask="0x00003FFF" name="LST"/>
        </register>
        <register caption="HC Root Hub A Register" name="UHP_HCRHDESCRIPTORA" offset="0x48" rw="RW" size="4">
          <bitfield caption="Number of downstream ports (read-only)" mask="0x000000FF" name="NDP"/>
          <bitfield caption="Power switching mode (read/write)" mask="0x00000100" name="PSM"/>
          <bitfield caption="No power switching (read/write)" mask="0x00000200" name="NPS"/>
          <bitfield caption="Device type (read-only)" mask="0x00000400" name="DT"/>
          <bitfield caption="Overcurrent protection mode (read/write)" mask="0x00000800" name="OCPM"/>
          <bitfield caption="No overcurrent protection (read/write)" mask="0x00001000" name="NOCP"/>
          <bitfield caption="Power-on to power-good time (read/write)" mask="0xFF000000" name="POTPG"/>
        </register>
        <register caption="HC Root Hub B Register" name="UHP_HCRHDESCRIPTORB" offset="0x4C" rw="RW" size="4">
          <bitfield mask="0x00000001" name="DR0"/>
          <bitfield mask="0x00000002" name="DR1"/>
          <bitfield mask="0x00000004" name="DR2"/>
          <bitfield mask="0x00000008" name="DR3"/>
          <bitfield mask="0x00000010" name="DR4"/>
          <bitfield mask="0x00000020" name="DR5"/>
          <bitfield mask="0x00000040" name="DR6"/>
          <bitfield mask="0x00000080" name="DR7"/>
          <bitfield mask="0x00000100" name="DR8"/>
          <bitfield mask="0x00000200" name="DR9"/>
          <bitfield mask="0x00000400" name="DR10"/>
          <bitfield mask="0x00000800" name="DR11"/>
          <bitfield mask="0x00001000" name="DR12"/>
          <bitfield mask="0x00002000" name="DR13"/>
          <bitfield mask="0x00004000" name="DR14"/>
          <bitfield mask="0x00008000" name="DR15"/>
          <bitfield mask="0x00010000" name="PPCM0"/>
          <bitfield mask="0x00020000" name="PPCM1"/>
          <bitfield mask="0x00040000" name="PPCM2"/>
          <bitfield mask="0x00080000" name="PPCM3"/>
          <bitfield mask="0x00100000" name="PPCM4"/>
          <bitfield mask="0x00200000" name="PPCM5"/>
          <bitfield mask="0x00400000" name="PPCM6"/>
          <bitfield mask="0x00800000" name="PPCM7"/>
          <bitfield mask="0x01000000" name="PPCM8"/>
          <bitfield mask="0x02000000" name="PPCM9"/>
          <bitfield mask="0x04000000" name="PPCM10"/>
          <bitfield mask="0x08000000" name="PPCM11"/>
          <bitfield mask="0x10000000" name="PPCM12"/>
          <bitfield mask="0x20000000" name="PPCM13"/>
          <bitfield mask="0x40000000" name="PPCM14"/>
          <bitfield mask="0x80000000" name="PPCM15"/>
        </register>
        <register caption="HC Root Hub Status Register" name="UHP_HCRHSTATUS" offset="0x50" rw="RW" size="4">
          <bitfield caption="Local power status (read/write)" mask="0x00000001" name="LPS"/>
          <bitfield caption="Overcurrent indicator (read-only)" mask="0x00000002" name="OCI"/>
          <bitfield caption="Device remote wake-up enable (read/write)" mask="0x00008000" name="DRWE"/>
          <bitfield caption="Local power status change (read/write)" mask="0x00010000" name="LPSC"/>
          <bitfield caption="Overcurrent indication change (read/write)" mask="0x00020000" name="OCIC"/>
          <bitfield caption="Clear remote wake-up enable (read/write)" mask="0x80000000" name="CRWE"/>
        </register>
        <register caption="HC Port 1 Status and Control Register 0" name="UHP_HCRHPORTSTATUS" offset="0x54" rw="RW" size="4" count="2">
          <bitfield mask="0x00000001" name="CCS_CPE"/>
          <bitfield mask="0x00000002" name="PES_SPE"/>
          <bitfield mask="0x00000004" name="PSS_SPS"/>
          <bitfield mask="0x00000008" name="POCI_CSS"/>
          <bitfield mask="0x00000010" name="PRS_SPR"/>
          <bitfield mask="0x00000100" name="PPS_SPP"/>
          <bitfield mask="0x00000200" name="LSDA_CPP"/>
          <bitfield caption="Port 1 connect status change (read/write, write '1' to clear)" mask="0x00010000" name="CSC"/>
          <bitfield caption="Port 1 enable status change (read/write, write '1' to clear)" mask="0x00020000" name="PESC"/>
          <bitfield caption="Port 1 suspend status change (read/write, write '1' to clear)" mask="0x00040000" name="PSSC"/>
          <bitfield caption="Port 1 overcurrent indicator change (read/write)" mask="0x00080000" name="OCIC"/>
          <bitfield caption="Port 1 reset status change (read/write, write '1' to clear)" mask="0x00100000" name="PRSC"/>
        </register>
      </register-group>
    </module>
    <module name="USART" caption="Universal Synchronous Asynchronous Receiver Transmitter" id="11278" version="C">
      <register-group name="USART">
        <register caption="Control Register" name="US_CR" offset="0x000" rw="W" size="4">
          <bitfield caption="Reset Receiver" mask="0x00000004" name="RSTRX"/>
          <bitfield caption="Reset Transmitter" mask="0x00000008" name="RSTTX"/>
          <bitfield caption="Receiver Enable" mask="0x00000010" name="RXEN"/>
          <bitfield caption="Receiver Disable" mask="0x00000020" name="RXDIS"/>
          <bitfield caption="Transmitter Enable" mask="0x00000040" name="TXEN"/>
          <bitfield caption="Transmitter Disable" mask="0x00000080" name="TXDIS"/>
          <bitfield caption="Reset Status Bits" mask="0x00000100" name="RSTSTA"/>
          <bitfield caption="Start Break" mask="0x00000200" name="STTBRK"/>
          <bitfield caption="Stop Break" mask="0x00000400" name="STPBRK"/>
          <bitfield caption="Clear TIMEOUT Flag and Start Time-out After Next Character Received" mask="0x00000800" name="STTTO"/>
          <bitfield caption="Send Address" mask="0x00001000" name="SENDA"/>
          <bitfield caption="Reset Iterations" mask="0x00002000" name="RSTIT"/>
          <bitfield caption="Reset Non Acknowledge" mask="0x00004000" name="RSTNACK"/>
          <bitfield caption="Start Time-out Immediately" mask="0x00008000" name="RETTO"/>
          <bitfield caption="Request to Send Enable" mask="0x00040000" name="RTSEN"/>
          <bitfield caption="Request to Send Disable" mask="0x00080000" name="RTSDIS"/>
          <bitfield caption="Abort LIN Transmission" mask="0x00100000" name="LINABT"/>
          <bitfield caption="Send LIN Wakeup Signal" mask="0x00200000" name="LINWKUP"/>
          <bitfield caption="Request to Clear the Comparison Trigger" mask="0x10000000" name="REQCLR"/>
        </register>
        <register caption="Mode Register" name="US_MR" offset="0x004" rw="RW" size="4">
          <bitfield caption="USART Mode of Operation" mask="0x0000000F" name="USART_MODE" values="US_MR__USART_MODE"/>
          <bitfield caption="Clock Selection" mask="0x00000030" name="USCLKS" values="US_MR__USCLKS"/>
          <bitfield caption="Character Length" mask="0x000000C0" name="CHRL" values="US_MR__CHRL"/>
          <bitfield caption="Synchronous Mode Select" mask="0x00000100" name="SYNC"/>
          <bitfield caption="Parity Type" mask="0x00000E00" name="PAR" values="US_MR__PAR"/>
          <bitfield caption="Number of Stop Bits" mask="0x00003000" name="NBSTOP" values="US_MR__NBSTOP"/>
          <bitfield caption="Channel Mode" mask="0x0000C000" name="CHMODE" values="US_MR__CHMODE"/>
          <bitfield caption="Bit Order" mask="0x00010000" name="MSBF"/>
          <bitfield caption="9-bit Character Length" mask="0x00020000" name="MODE9"/>
          <bitfield caption="Clock Output Select" mask="0x00040000" name="CLKO"/>
          <bitfield caption="Oversampling Mode" mask="0x00080000" name="OVER"/>
          <bitfield caption="Inhibit Non Acknowledge" mask="0x00100000" name="INACK"/>
          <bitfield caption="Disable Successive NACK" mask="0x00200000" name="DSNACK"/>
          <bitfield caption="Inverted Data" mask="0x00800000" name="INVDATA"/>
          <bitfield caption="Maximum Number of Automatic Iteration" mask="0x07000000" name="MAX_ITERATION"/>
          <bitfield caption="Receive Line Filter" mask="0x10000000" name="FILTER"/>
        </register>
        <register caption="Interrupt Enable Register" name="US_IER" offset="0x008" rw="W" size="4" atomic-op="set:US_IMR">
          <bitfield caption="RXRDY Interrupt Enable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Enable" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Enable" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable (available in all USART modes of operation)" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable (available in all USART modes of operation)" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Enable" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Enable" mask="0x00000080" name="PARE"/>
          <bitfield caption="Time-out Interrupt Enable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max number of Repetitions Reached Interrupt Enable" mask="0x00000400" name="ITER"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable (available in all USART modes of operation)" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable (available in all USART modes of operation)" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Non Acknowledge Interrupt Enable" mask="0x00002000" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Interrupt Enable" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Comparison Interrupt Enable" mask="0x00400000" name="CMP"/>
        </register>
        <register caption="Interrupt Disable Register" name="US_IDR" offset="0x00C" rw="W" size="4" atomic-op="clear:US_IMR">
          <bitfield caption="RXRDY Interrupt Disable" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Disable" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Disable" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable (available in all USART modes of operation)" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable (available in all USART modes of operation)" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Disable" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Disable" mask="0x00000080" name="PARE"/>
          <bitfield caption="Time-out Interrupt Disable" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Disable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached Interrupt Disable" mask="0x00000400" name="ITER"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable (available in all USART modes of operation)" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable (available in all USART modes of operation)" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Non Acknowledge Interrupt Disable" mask="0x00002000" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Interrupt Disable" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Comparison Interrupt Disable" mask="0x00400000" name="CMP"/>
        </register>
        <register caption="Interrupt Mask Register" name="US_IMR" offset="0x010" rw="R" size="4" atomic-op="read:US_IMR">
          <bitfield caption="RXRDY Interrupt Mask" mask="0x00000001" name="RXRDY"/>
          <bitfield caption="TXRDY Interrupt Mask" mask="0x00000002" name="TXRDY"/>
          <bitfield caption="Receiver Break Interrupt Mask" mask="0x00000004" name="RXBRK"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask (available in all USART modes of operation)" mask="0x00000008" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask (available in all USART modes of operation)" mask="0x00000010" name="ENDTX"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000020" name="OVRE"/>
          <bitfield caption="Framing Error Interrupt Mask" mask="0x00000040" name="FRAME"/>
          <bitfield caption="Parity Error Interrupt Mask" mask="0x00000080" name="PARE"/>
          <bitfield caption="Time-out Interrupt Mask" mask="0x00000100" name="TIMEOUT"/>
          <bitfield caption="TXEMPTY Interrupt Mask" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Max Number of Repetitions Reached Interrupt Mask" mask="0x00000400" name="ITER"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask (available in all USART modes of operation)" mask="0x00000800" name="TXBUFE"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask (available in all USART modes of operation)" mask="0x00001000" name="RXBUFF"/>
          <bitfield caption="Non Acknowledge Interrupt Mask" mask="0x00002000" name="NACK"/>
          <bitfield caption="Clear to Send Input Change Interrupt Mask" mask="0x00080000" name="CTSIC"/>
          <bitfield caption="Comparison Interrupt Mask" mask="0x00400000" name="CMP"/>
        </register>
